Repository: geeksfactory/geeksqlite
Catalog: language/*/LC_MESSAGES/geeksqlite.po
Languages: eo

source: An error occured while executing a SQL database query!
eo: Okaziz eraro dum la plenumado de SQL ordono!

source: SQL query which caused the error: <tt>%(query)s</tt> SQLite error message: <tt>%(error)s</tt>
eo: SQL ordono kia kaŭzis la eraron: <tt>%(query)s</tt> SQLite erarmesaĝo: <tt>%(error)s</tt>

source: SQL error
eo: SQLite Eraro

source: Name
eo: Nomo

source: Type
eo: Tipo

source: Error while creating new table. Did you fill in all form fields? Did you add any fields to your table?
eo: Okazis eraro dum la kreado de la nova tabelo. Ĉu vi plenisgis ĉiujn kampojn? Ĉu la tabelo entute havas kampojn?

source: Error while modifing table. Did you fill in all fields? Are there any fields in your new table?
eo: Okaziz eraro dum la modifiado de la tablo. Ĉu vi plenigis ĉiujn kampojn? Ĉu la tabelo entute havas kampojn?

source: %(start)d to %(end)d of %(total)d
eo: %(start)d ĝis %(end)d de entute %(total)d

source: -- -- OPEN FILE -- --
eo: -- -- MALFERMAS DOSIERON -- --

source: Unable to open database file
eo: Ne eblis malfermi la datumbazon.

source: table
eo: Tabelo

source: index
eo: ŝlosilo

source: view
eo: vido

source: Select Table
eo: Elektu tabelon

source: No index was created because you did not fill in all required fields!
eo: Neniu ŝlosilo estis kreita ĉar vi ne plenigis cxiuj devigajn kampojn!

source: No database loaded
eo: Nenia datumbazo ŝarĝita

source: Edit field contents
eo: Redakti kampenhavon

source: -- -- CLOSE FILE -- --
eo: -- -- FERMAS DOSIERON -- --

source: Modify Table
eo: Modifii tabelon

source: Drop Table
eo: Forigi tabelon

source: Do you really want to remove the table %s?
eo: Ĉu vi vere volas forigi la tabelon %s?

source: Drop View
eo: Forigi tabelon

source: Do you really want to remove the view %s?
eo: Ĉu vi vere volas forigi la indekson %s?

source: No view was created because you did not fill in all required fields!
eo: Neniu vido estis kreita ĉar vi ne plenigis cxiuj devigajn kampojn!

source: Drop Index
eo: Forigu ŝlosilo

source: Do you really want to remove the index %s?
eo: Ĉu vi vere volas forigi la ŝlosilo %s?

source: Empty result
eo: Malplena rezulto

source: [SQLite Error]
eo: [SQLite Eraro]

source: [geekSQLite Error] Not a complete statement!
eo: [geekSQLite Eraro] Malkompleta ordono!

source: You have to restart geek'SQLite to apply some changes like the language
eo: Vi devas restarti geek'SQLite por apliki la lingvoŝanĝon

source: Schema
eo: Skemo

source: Add Field
eo: Aldoni kampon

source: Name:
eo: Nomo:

source: Type:
eo: Tipo:

source: nothing. just a field.
eo: simpla kampo.

source: Filter
eo: Filtrilo

source: Create Index
eo: Krei ŝlosilon

source: Index name:
eo: Indeksnomo:

source: Field:
eo: Kampo:

source: Order:
eo: Ordo:

source: ASC (Ascending) DESC (Descending)
eo: ASC (Kreskante) DESC (Malkreskante)

source: Select index:
eo: Elektu ŝlosilon:

source: _File
eo: Dosiero

source: Import
eo: Importi

source: SQL file
eo: SQL dosiero

source: Export
eo: Eksporti

source: Current table as CSV (using current filters)
eo: Aktuala tabelo kiel CSV (uzanta aktualajn filtrilojn)

source: _Edit
eo: Redakti

source: Create Table
eo: Krei tabelon

source: _Help
eo: Helpo

source: Database Structure
eo: Datumbaza strukturo

source: Browse Data
eo: Esplori datumojn

source: SQL string:
eo: SQL ĉeno

source: Execute!
eo: Plenumu!

source: Errors (if any):
eo: Eraroj:

source: Result:
eo: Rezulto:

source: Execute SQL
eo: Plenumi SQL

source: SQL Log
eo: SQL protokolo

source: Preferences
eo: Agordoj

source: Language:
eo: Lingvo:

source: Encoding:
eo: Kodoprezento:

source: Locale
eo: Asimilado

source: .csv Seperator:
eo: .csv Disigilo:

source: mask .csv values with ""
eo: maski .csv valoroj per ""

source: Table name:
eo: Tabelnomo:

source: Add field
eo: Aldoni kampon

source: Delete field
eo: Forigi kampon

source: Warning: SQLite3 does NOT support modifying tables natively. What geek'SQLite does ist to export all your data, to drop the table, create the new one and re-import all your data. This feature ist beta! We are NOT liable for any data loss!
eo: Averto: SQLite3 ne subtenas modifiadon de tabeloj. Do geek'SQLite simple eksportas ĉiujn datumojn, forigas la tabelon, kreas la novan kaj reimportas cxiujn viajn datumojn. Tiu-cxi trajto estas beta! Ni ne respondecas pri perdo de datumoj!

source: Select table:
eo: Elektu tabelon:

source: Create View
eo: Krei indekson

source: SELECT query:
eo: SELECT ordono:

source: Select view:
eo: Elektu indekson:
